In [1]:
import pandas as pd

ser1 = pd.Series([10,20,30,40])

ser1

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
#Create a DataFrame using the constructor
df = pd.DataFrame([30,50,20])
df

    0
0  30
1  50
2  20

In [3]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [6]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
print("These are the names of the columns",list(df.columns))
print("These are the row indices",list(df.index))

These are the names of the columns [0]
These are the row indices [0, 1, 2]

In [11]:
# Renaming the columns
df.columns = ['V1']
df

   V1
0  30
1  50
2  20

In [13]:
# Renaming the indices
df.index = ['R1','R2','R3']
df

    V1
R1  30
R2  50
R3  20

In [14]:
df1 = pd.DataFrame([[10,15,20],[100,200,300]])

print("Shape of new data frame",df1.shape)

df1

Shape of new data frame (2, 3)

     0    1    2
0   10   15   20
1  100  200  300

In [15]:
df1 = pd.DataFrame([[10,15,20],[100,200,300]],\
                  columns=['V1', 'V2', 'V3'],\
                  index=['R1','R2'])

df1

     V1   V2   V3
R1   10   15   20
R2  100  200  300